blog-posts/2004-03-10-planner-tasks-from-notes.org
#+TITLE: Planner tasks from notes

March 10th, 2004 -
[[http://sachachua.com/blog/p/1867][http://sachachua.com/blog/p/1867]]

Planner tasks from notes should update the notes page that they link
 to while maintaining the special links. This means that
 planner-jump-to-linked-task needs to be smarter.

Let us look at case 1: Link to plan page note

The plan page has a date link, no anchor. The date page has a plan
 link with an anchor. Example:

#+BEGIN_EXAMPLE
     #A1  _ Foo (2004.03.11)
#+END_EXAMPLE

#+BEGIN_EXAMPLE
     #A1  _ Foo ([[SomePage#1][SomePage]])
#+END_EXAMPLE

Problem! The plan page does not contain enough information to
 reconstruct the link if necessary. I can't think of a neat way to fix
 this yet. Can anyone?
